#pragma once

/**
 * Name: GTASA-STEAM
 * Version: 0.1
 */

#ifdef _MSC_VER
#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class GTABase.DFFExtraData
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UDFFExtraData : public UDataAsset
	{
	public:
		TArray<struct FGTAModelData>                               ModelData;                                               // 0x0030(0x0010) ZeroConstructor, NativeAccessSpecifierPublic

	public:
		void CheckAllReferences();
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.DistantHLODBuilder
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UDistantHLODBuilder : public UDataAsset
	{
	public:
		void BuildAtlas();
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GTAGameMode
	 * Size -> 0x0038 (FullSize[0x02F8] - InheritedSize[0x02C0])
	 */
	class AGTAGameMode : public AGameModeBase
	{
	public:
		class UGameterface* Gameface;                                                // 0x02C0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_D55P[0x30];                                  // 0x02C8(0x0030) MISSED OFFSET (PADDING)

	public:
		class UGameterface* GetGameterface();
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.Gameterface
	 * Size -> 0x0718 (FullSize[0x0740] - InheritedSize[0x0028])
	 */
	class UGameterface : public UObject
	{
	public:
		unsigned char                                              UnknownData_EGR5[0x10];                                  // 0x0028(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ALevelSequenceActor* CinematicPlayer;                                         // 0x0038(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_E9FT[0x20];                                  // 0x0040(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FGTAStreamRequest>                           StreamRequests;                                          // 0x0060(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		class UGTAEffectLibrary* EffectsLibrary;                                          // 0x0070(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              Cinematics[0x10];                                        // 0x0078(0x0010) UNKNOWN PROPERTY: ArrayProperty
		class UGTACinematicDB* CinematicDB;                                             // 0x0088(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_T2TC[0x8];                                   // 0x0090(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              CarRecordings[0x28];                                     // 0x0098(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		class UGTAHaptics* Haptics;                                                 // 0x00C0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UEntityLinker* EntityLink;                                              // 0x00C8(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      ExtraPedDensityMult;                                     // 0x00D0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      ExtraPedDistanceMult;                                    // 0x00D4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      ExtraCarDensityMult;                                     // 0x00D8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      ExtraCarDistanceMult;                                    // 0x00DC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_HSTB[0x18];                                  // 0x00E0(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              LoadedObjects[0x50];                                     // 0x00F8(0x0050) UNKNOWN PROPERTY: SetProperty
		class FName                                                CurrentCutscene;                                         // 0x0148(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AGTAScalability* Scalability;                                             // 0x0150(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AGTARadar* Radar;                                                   // 0x0158(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AGTATargetHalo* TargetHalo;                                              // 0x0160(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AGTASkidmarks* Skidmarks;                                               // 0x0168(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AGTARopes* Ropes;                                                   // 0x0170(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AGTABloodyFootprints* BloodyFootprints;                                        // 0x0178(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UGTASceneProbeListing* SceneProbes;                                             // 0x0180(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AGTAWater* Water;                                                   // 0x0188(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UGTATexLookup* TextureLookup;                                           // 0x0190(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDFFExtraData* ModelData;                                               // 0x0198(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UGTAPathfindNodes* PathfindingNodes;                                        // 0x01A0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UFont*>                                       Fonts;                                                   // 0x01A8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<class UGTASoundPak*>                                Paks;                                                    // 0x01B8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		class UProcTextData* RoadSignText;                                            // 0x01C8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UMaterialInstanceConstant*>                   RoadSignPalettes;                                        // 0x01D0(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<class UGTASoundBank*>                               Streams;                                                 // 0x01E0(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<class UIMGFile*>                                    IMGs;                                                    // 0x01F0(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      Markers;                                                 // 0x0200(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		class UClass* TargetHaloClass;                                         // 0x0210(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass* FireClass;                                               // 0x0218(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass* DecalHelperClass;                                        // 0x0220(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UMaterialInstanceConstant* DefaultScorchedMI;                                       // 0x0228(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WaterDetailDistance;                                     // 0x0230(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WaterDetailDistance_InBoat;                              // 0x0234(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       NeedsInvincibilityCheck;                                 // 0x0238(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       InvincibilityNewGameCheck;                               // 0x0239(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6ZDP[0x6];                                   // 0x023A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class USkeletalMesh*>                               SKMsSetUpForGangSigns;                                   // 0x0240(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<struct FSpecialCutsceneMapping>                     SpecialCutsceneMappings;                                 // 0x0250(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		class UMaterialInterface* DefaultHeadlightOffMaterial;                             // 0x0260(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UMaterialInterface* DefaultHeadlightOnMaterial;                              // 0x0268(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass* BloodPoolClass;                                          // 0x0270(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              SpecialCharacterExcludeFromWindFlapping[0x50];           // 0x0278(0x0050) UNKNOWN PROPERTY: SetProperty
		class UUI_GTAHUDDrawer* CurrentHudDrawer;                                        // 0x02C8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UUI_GTAHUDDrawer* CurrentPriorityHudDrawer;                                // 0x02D0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class FString, class UClass*>                         TransitionMap;                                           // 0x02D8(0x0050) Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic
		class UUserWidget* CurrentMenu;                                             // 0x0328(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OFVG[0x4];                                   // 0x0330(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       LaunchedFromMainMenu;                                    // 0x0334(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsMenuMapUpdating;                                       // 0x0335(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q9C9[0x2];                                   // 0x0336(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    listeningForKeyMapping;                                  // 0x0338(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MX1B[0xC];                                   // 0x033C(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FHUDItem>                                    items;                                                   // 0x0348(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NEA8[0x128];                                 // 0x0358(0x0128) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<int32_t, int32_t>                                     CEntityRefCounter;                                       // 0x0480(0x0050) NativeAccessSpecifierPublic
		struct FLinearColor                                        DynamicColorBoost;                                       // 0x04D0(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FHelpTextOverrides>                          HelpTextOverrides;                                       // 0x04E0(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		unsigned char                                              CollisionCache[0x28];                                    // 0x04F0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              CollisionSectionContainer[0x28];                         // 0x0518(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              UnknownData_5N3Q[0x10];                                  // 0x0540(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              PathIplContainer[0x28];                                  // 0x0550(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		class UGTARadioStream* RadioStreams;                                            // 0x0578(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              TrafficLightCache[0x28];                                 // 0x0580(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		class AGTARTCaptureBase* ReflectionActor;                                         // 0x05A8(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             CurrentReflectionPosition;                               // 0x05B0(0x000C) Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             TargetReflectionPosition;                                // 0x05BC(0x000C) Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor* ReflectionTargetContext;                                 // 0x05C8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AGTATimeOfDay* ActiveTOD;                                               // 0x05D0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BW0C[0x8];                                   // 0x05D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              SSRReflectionClass[0x28];                                // 0x05E0(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		unsigned char                                              PlanarReflectionClass[0x28];                             // 0x0608(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		unsigned char                                              CubeReflectionClass[0x28];                               // 0x0630(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		TArray<struct FReflectionMaterialSetup>                    ReflectionMaterialSetups;                                // 0x0658(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		class UClass* ChalkOutlineClass;                                       // 0x0668(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass* CinematicCarClass;                                       // 0x0670(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              IFPFileContainer[0x28];                                  // 0x0678(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              UnknownData_YV7Y[0x18];                                  // 0x06A0(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USkeletalMesh* SpecialBlankMeshForCutscenes;                            // 0x06B8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UUI_DesignTimeUserWidget* SocialClubUI;                                            // 0x06C0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TBB3[0x18];                                  // 0x06C8(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass* IntroMovieClass;                                         // 0x06E0(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject* IntroMovieFile;                                          // 0x06E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject* LowQualityIntroMovieFile;                                // 0x06F0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UUI_DesignTimeUserWidget* IntroMovieAsset;                                         // 0x06F8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		uint64_t                                                   FramesSinceLastLongDistanceCut;                          // 0x0700(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UMaterialInstance* VerticalBlurInstance;                                    // 0x0708(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UMaterialInstance* HorizontalBlurInstance;                                  // 0x0710(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UGTAActivityManager* ActivityManager;                                         // 0x0718(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BL2X[0x20];                                  // 0x0720(0x0020) MISSED OFFSET (PADDING)

	public:
		bool WasRightBumperButtonJustPressed();
		bool WasLeftBumperButtonJustPressed();
		bool WasBackButtonJustPressed();
		bool WasAcceptButtonJustPressed();
		bool UseSystemFont();
		bool UseSocialClubInGameMenu();
		void UpdateMapCustomWaypoint();
		class FString TheTextGet(const class FString& Key, const class FString& missionText);
		void StopIntroMovie();
		void StopCredits();
		void StartTransition(const class FString& TransitionToStart);
		class UUserWidget* StartRemapping(int32_t mappingID);
		void StartNewGameFromMenu();
		void StartLoadingTransition();
		void StartIntroMovie();
		class AGTAExplosion* SpawnExplosion(const struct FVector& Location, EGTAExplosionType Type, EGTAExplosionSurface Surface, const struct FVector& SurfaceNormal, float Scale, int32_t DebrisCount, class AActor* ExplodingActor, bool bSuppressLight);
		void SocialClubSignUp();
		void SocialClubSignOut();
		void SocialClubSignIn();
		void SocialClubShowAchievements();
		bool SocialClubIsLinked();
		bool SocialClubAreServicesAvailable();
		bool STATIC_SnapToWorldZ(struct FVector* Coord, float AdditionalZOffset);
		bool SlotHasSave(int32_t slotnum);
		void ShowHUDDrawer(bool Visible, bool CreateIfNotMade);
		bool ShouldUseTransitionWarnings(float* TimeBeforeWarning);
		bool ShouldShowFullOptions();
		void STATIC_SetUserFocusToGameViewport();
		void SetTransitionStateFadeTime(EGTATransitionState StateToChange, float TimeToFade);
		void SetMenuTransitionStateFadeTime(EGTATransitionState StateToChange, float TimeToFade);
		void SetLoadingTransitionProgress(float Progress);
		void SetCustomWaypoint(const struct FVector& position);
		void SaveKeyboardMappings();
		void SaveDataInSlot(int32_t SlotIndex);
		bool ResumeGameFromMenu();
		bool RestartWithFreshMenu();
		void ReplaceGameSpecificImageTags(class FString* QueuedMessage);
		bool RefreshSocialClubAchivements();
		void RefreshMenuUserInfo();
		void PromptLogin();
		void PlayHapticEffectBP(EHapticEffectType Type);
		bool PlatformRequiresLogin();
		void OnAudioTabChanged(bool wasSelected);
		bool MoveMenuToGameTab(EGTASaveTabState tabState);
		void MissionRetryCallback(bool doRetry);
		void MenuMapExtra();
		bool LoadDataInSlot(int32_t SlotIndex);
		bool IsViewport4kOrGreater();
		bool IsVeryWideScreen();
		bool isSlotCheckpointSave(int32_t slotnum);
		bool isSlotAutoSave(int32_t slotnum);
		bool IsShowingControllerReconnectScreen();
		bool IsShowAllOptions();
		bool IsReleaseBuild();
		bool IsPlayingGame();
		bool STATIC_IsJapaneseBuild();
		bool IsIntroMoviePlaying(bool AllowHandleStop);
		bool IsInCredits();
		bool IsCurrentTransition(const class FString& Name);
		bool IsActiveControllerLoggedIn();
		void InterruptCurrentTransition(const class FString& TransitionToStart, EGTATransitionState startingState, bool takeOldOpacity);
		void InterruptCurrentMenuTransition(const class FString& TransitionToStart, EGTATransitionState startingState, bool takeOldOpacity);
		bool HasSaveData();
		bool HasCurrentTransitionScreen(bool CheckOnlyInGameTransitions);
		void GrabFocus();
		float STATIC_GetWorldZ(const struct FVector& FromCoord, bool* success);
		class FString GetVersionString();
		class UTexture2D* GetUVMappingForMenuTabPrev(float* U, float* V, float* ULength, float* VLength);
		class UTexture2D* GetUVMappingForMenuTabNext(float* U, float* V, float* ULength, float* VLength);
		class UTexture2D* GetUVImageForHUDMapping(EHIDMapping mapping, float* U, float* V, float* ULength, float* VLength);
		class UTexture2D* GetUserNameAndImage(class FString* OutName);
		class UUITransition* GetTransitionManager();
		float GetTimeOfDay();
		TArray<class FString> GetStats(TArray<class FString>* StatValues, class FString* CriminalRating);
		TArray<struct FSCAchive> GetSocialClubAchivements();
		class UClass* GetScalabilityClass();
		TArray<class FString> GetSaveDataNames();
		class FString GetSaveDataName(int32_t SlotIndex);
		void GetRightStickValues(float* X, float* Y);
		class URage* GetRageActor();
		int32_t GetRadioStationOffset();
		EPlatformType STATIC_GetPlatformType();
		float GetOptionTextSize();
		float GetOptionHelpTextSize();
		int32_t GetNextValidLanguageIndex(bool IsLanguage, bool Forward, int32_t currentIndex);
		float GetMapZoomOut();
		float GetMapZoomIn();
		class FString GetMappingStringForButton(int32_t nButtonID, int32_t whichType);
		TArray<class FName> GetMapLegendNames();
		void GetMapLegend(TArray<class UTexture2D*>* Textures, TArray<class FText>* Strings);
		void GetMapAreaName(const struct FVector& WorldPosition, class FString* OutName);
		void GetLeftStickValues(float* X, float* Y);
		int32_t GetLastSaveSlotIndex();
		TArray<struct FKeyboardDisplayStrings> GetKeyboardMappings(int32_t whichType);
		class UTexture2D* GetHIDTexture();
		struct FVector GetGTAPlayerPosition();
		bool GetGroundZCoord(const struct FVector& FromCoord, struct FVector* OutCoord);
		EGTAInputType GetCurrentInputType();
		bool GetButtonMappingReleased(EHIDMapping mapping);
		bool GetButtonMappingJustPressed(EHIDMapping mapping);
		bool GetButtonMappingIsPressed(EHIDMapping mapping);
		class FString GetBriefString();
		int32_t GetAppropriateGamepadTab();
		int32_t GetActiveControllerIndex();
		bool GameHasGangsOverlay();
		bool GameHasFlightGamepadTab();
		bool GameHasBMXGamepadTab();
		void FreezeTime(int32_t Hours, int32_t Minutes, int32_t Seconds);
		void ForceMapSwitchRefresh(bool MenuMode);
		void ExitGame();
		bool DoesLanguageUseLargerHeightSubtitles();
		bool DoesGameViewportHaveFocus();
		void DeleteSavedKeyboardMappings();
		void DeleteDataInSlot(int32_t SlotIndex);
		void ContinueTransition(EGTATransitionState toState);
		void ContinueMenuTransition(EGTATransitionState toState);
		void CloseCurrentTransition();
		void CloseCurrentMenuTransition();
		void ClearCustomWaypoint();
		void CleanupCinematicActorOnEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
		bool STATIC_CheckWorldLine(const struct FVector& Start, const struct FVector& finished, struct FVector* outCol, struct FVector* outNormal, bool bCheckBuildings, bool bCheckVehicles, bool bCheckPeds);
		void CheckShowAllOptionsChanged();
		void BPUpdateVolumeMixers();
		void AutoDestroyedParticleSystem(class UParticleSystemComponent* Component);
		bool AreMultipleTouchesDown();
		bool AllowMapJump();
		bool AllowCustomWaypointManagement();
		bool AllowActiveControllerSet();
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.EntityLinker
	 * Size -> 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
	 */
	class UEntityLinker : public UObject
	{
	public:
		unsigned char                                              UnknownData_XS0Q[0x50];                                  // 0x0028(0x0050) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GTAOptionsList
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class UGTAOptionsList : public UDataAsset
	{
	public:
		EGTASettingsCategory                                       Category;                                                // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ONKG[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FGTAOptionsItemTemplate>                     Options;                                                 // 0x0038(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GTAFidelityOption
	 * Size -> 0x0068 (FullSize[0x0098] - InheritedSize[0x0030])
	 */
	class UGTAFidelityOption : public UDataAsset
	{
	public:
		bool                                                       IsCustomSet;                                             // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M0Z1[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                OptionName;                                              // 0x0038(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FGTAFidelityChanges                                 Changables;                                              // 0x0050(0x0044) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IGZN[0x4];                                   // 0x0094(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GameterSettings
	 * Size -> 0x0208 (FullSize[0x0328] - InheritedSize[0x0120])
	 */
	class UGameterSettings : public UGameUserSettings
	{
	public:
		unsigned char                                              UnknownData_TFO8[0x4];                                   // 0x0120(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGTASettings_Graphics                               Graphics;                                                // 0x0124(0x0080) Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FGTASettings_Controls                               Controls;                                                // 0x01A4(0x0048) Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FGTASettings_Gameplay                               Gameplay;                                                // 0x01EC(0x001C) Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FGTASettings_Audio                                  Audio;                                                   // 0x0208(0x0020) Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FGTASettings_Language                               Language;                                                // 0x0228(0x001C) Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CQRV[0x4];                                   // 0x0244(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              DefaultClassName;                                        // 0x0248(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    FidelitySetting;                                         // 0x0258(0x0004) Edit, BlueprintVisible, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DefaultsVersion;                                         // 0x025C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    HeldLastResolution;                                      // 0x0260(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    HeldLastScreenMode;                                      // 0x0264(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    HeldLastOutputMonitor;                                   // 0x0268(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       RequiresRestart;                                         // 0x026C(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDisableDynamicResolution;                               // 0x026D(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_21KE[0x2];                                   // 0x026E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FName>                                        UserOverrideCVars;                                       // 0x0270(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
		TArray<class FString>                                      UserOverrideValues;                                      // 0x0280(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
		TArray<struct FGTAFidelitySettings>                        PlatformFidelitySettings;                                // 0x0290(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    LastRefreshRate;                                         // 0x02A0(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FUG9[0x4];                                   // 0x02A4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              LastOutputMonitorName;                                   // 0x02A8(0x0010) ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    lastSystemLanguage;                                      // 0x02B8(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ForcedSCEnvironment;                                     // 0x02BC(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		uint32_t                                                   TotalTimePlayed;                                         // 0x02C0(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T4EF[0x10];                                  // 0x02C4(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    GPUBenchmarkScore;                                       // 0x02D4(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V2EG[0x50];                                  // 0x02D8(0x0050) MISSED OFFSET (PADDING)

	public:
		void UpdateOutputMonitorInfo();
		void UpdateFidelitySettings(bool SkipCallback, bool FromDefaultsCall);
		bool UpdateFidelityOptionToMatchSettings(bool RefreshSettings);
		void UpdateDefaultVersion(bool SkipSave);
		void UpdateAllGraphicsSettings();
		void SetupGlobalSettingsCallbacks();
		void SetResolutionToDefault(bool doConfirmVideoMode);
		void SetIntValue(const class FName& VariableName, int32_t NewValue);
		void SetInitialScreenValues();
		void SetFloatValue(const class FName& VariableName, float NewValue);
		void SetBoolValue(const class FName& VariableName, bool NewValue);
		void RevertOption(const class FName& OptionName);
		void ResetSettingsToPlatformDefault(EGTASettingsCategory Category, bool SkipDisplayChanges, bool SkipSave);
		void ResetDefaultCheck();
		void RefreshSettingsOnFirstLoad(bool ForceReset);
		void OnTextureQualitySet();
		void OnShadowSet();
		void OnRTXSet();
		void OnResolutionSet(bool ApplySettings);
		void OnReflectionQualitySet();
		void OnOutputMonitorSet();
		void OnMotionBlurSet();
		void OnLensFlareSet();
		void OnLanguageSet();
		void OnFrameRateLimitSet(bool ApplySettings);
		void OnFrameRateLimitPCSet(bool ApplySettings);
		void OnDistanceScaleSet();
		void OnDisplayModeSet(bool ApplySettings);
		void OnDisableTargetOutlineSet();
		void OnDepthOfFieldSet();
		void OnCloudQualitySet();
		void OnClassicRadarSet();
		void OnCarReflectionMethodSet();
		void OnBloomSet();
		void OnAspectRatioSet();
		void OnAOSet();
		void OnAnisotropicSet();
		void NormalizeInitialScreenSize();
		bool IsOptionVisibleOnDevice(const class FName& Option);
		void InitializeGlobalSettings();
		bool HasEverSetToDefault();
		void GTASaveSettings(const class FName& SettingName);
		TArray<class FText> GetSelectionNamesForEmptyEntry(const class FName& EntryName);
		TArray<class FText> GetScreenResolutionNames();
		class FText GetPostChangeConfirmationDialogTitle(const class FName& EntryName, const class FText& SettingName, const class FText& ValueText);
		EGTAPlatforms GetPlatformToEmulate();
		class UClass* GetPlatformDefaults(EGTAPlatforms PlatformOverride, bool IsEditor);
		class UDefaultGameterSettings_Rules* GetPlatformDefaultRules();
		int32_t GetPCFidelitySetting();
		int32_t GetNumberValue(const class FName& VariableName);
		TArray<class FText> GetListOfFidelityOptionNamesFromSettings(EGTAPlatforms PlatformOverride, bool IsEditor);
		int32_t GetIntValue(const class FName& VariableName);
		float GetFloatValue(const class FName& VariableName);
		int32_t GetFidelityOptionsNum(EGTAPlatforms PlatformOverride, bool IsEditor);
		TArray<class FText> GetFidelityOptionNames(EGTAPlatforms PlatformOverride);
		class UGTAFidelityOption* GetCurrentFidelityOption(int32_t CurrentSelection, EGTAPlatforms PlatformOverride, bool IsEditor);
		bool GetBoolValue(const class FName& VariableName);
		TArray<class UGTAFidelityOption*> GetAllAvailableFidelityOptions(EGTAPlatforms PlatformOverride, bool IsEditor);
		void FinalOptionCheck(const class FName& OptionName);
		bool CheckSpecialOptionEnabled(const class FName& OptionName, int32_t* ErrorCode);
		void CheckDisplayModeAndUpdateSettings();
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.DefaultGameterSettings_Rules
	 * Size -> 0x0128 (FullSize[0x0150] - InheritedSize[0x0028])
	 */
	class UDefaultGameterSettings_Rules : public UObject
	{
	public:
		struct FGTASettings_Graphics                               Graphics;                                                // 0x0028(0x0080) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FGTASettings_Controls                               Controls;                                                // 0x00A8(0x0048) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FGTASettings_Gameplay                               Gameplay;                                                // 0x00F0(0x001C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FGTASettings_Audio                                  Audio;                                                   // 0x010C(0x0020) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FGTASettings_Language                               Language;                                                // 0x012C(0x001C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		int32_t                                                    FidelitySetting;                                         // 0x0148(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XW4R[0x4];                                   // 0x014C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GrungeProxy
	 * Size -> 0x0018 (FullSize[0x0238] - InheritedSize[0x0220])
	 */
	class AGrungeProxy : public AActor
	{
	public:
		unsigned char                                              UnknownData_MLZJ[0x8];                                   // 0x0220(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UProceduralMeshComponent*>                    BuiltComponents;                                         // 0x0228(0x0010) Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GrungePlacementBase
	 * Size -> 0x0018 (FullSize[0x0238] - InheritedSize[0x0220])
	 */
	class AGrungePlacementBase : public AActor
	{
	public:
		struct FGuid                                               Guid;                                                    // 0x0220(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIncludeInMapProxy;                                      // 0x0230(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VLES[0x7];                                   // 0x0231(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GTAActivityManager
	 * Size -> 0x00C0 (FullSize[0x00E8] - InheritedSize[0x0028])
	 */
	class UGTAActivityManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_AZ42[0xC0];                                  // 0x0028(0x00C0) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GTAActor
	 * Size -> 0x0080 (FullSize[0x02A0] - InheritedSize[0x0220])
	 */
	class AGTAActor : public AActor
	{
	public:
		uint32_t                                                   ModelID;                                                 // 0x0220(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_L3X3[0x4];                                   // 0x0224(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<int32_t, class UPrimitiveComponent*>                  AttachedFrameComponents;                                 // 0x0228(0x0050) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		struct FTimerHandle                                        FadeDelegate;                                            // 0x0278(0x0008) Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      CurrentAlpha;                                            // 0x0280(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_88Z3[0x4];                                   // 0x0284(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              bMaskFromDecalHeadlights : 1;                            // 0x0288(0x0001) BIT_FIELD Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bShouldImpostorInProxy : 1;                              // 0x0288(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bUseVertexAO : 1;                                        // 0x0288(0x0001) BIT_FIELD Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bUseVertexUplighting : 1;                                // 0x0288(0x0001) BIT_FIELD Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bUseDynamicVolumetricLookup : 1;                         // 0x0288(0x0001) BIT_FIELD Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bUseStaticVolumetricLookup : 1;                          // 0x0288(0x0001) BIT_FIELD Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bIgnoreForVolGridBuilding : 1;                           // 0x0288(0x0001) BIT_FIELD Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bSpawnedFromGTA : 1;                                     // 0x0288(0x0001) BIT_FIELD Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bProminent : 1;                                          // 0x0289(0x0001) BIT_FIELD NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bMultipleMeshComponents : 1;                             // 0x0289(0x0001) BIT_FIELD Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bTickLessOffScreen : 1;                                  // 0x0289(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bConstructSeparateProxy : 1;                             // 0x0289(0x0001) BIT_FIELD Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bUseDynamicVolumetricLookupIfDynamicallySpawned : 1;     // 0x0289(0x0001) BIT_FIELD Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bForceIncludeForStreamingBounds : 1;                     // 0x0289(0x0001) BIT_FIELD Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bHasReceiveTick : 1;                                     // 0x0289(0x0001) BIT_FIELD Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bCanHaveLatentAction : 1;                                // 0x0289(0x0001) BIT_FIELD Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		uint16_t                                                   VariationSeed;                                           // 0x028A(0x0002) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      DynamicAO;                                               // 0x028C(0x0004) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FColor                                              DynamicUplighting;                                       // 0x0290(0x0004) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      UplightStrength;                                         // 0x0294(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      AOStrength;                                              // 0x0298(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_NH55[0x4];                                   // 0x029C(0x0004) MISSED OFFSET (PADDING)

	public:
		void TimeChanged(bool bEditor);
		void SetScorched(bool scorched);
		void SetDamaged(bool damaged);
		void SetAlpha(float withAlpha);
		float GetTimeOfDay();
		void CheckTreeFarShadowSetting();
		void AddCollisionEffects(float impulseAmt, const struct FVector& Pos, const struct FVector& Dir);
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GTASMActor
	 * Size -> 0x0008 (FullSize[0x02A8] - InheritedSize[0x02A0])
	 */
	class AGTASMActor : public AGTAActor
	{
	public:
		class UStaticMeshComponent* Mesh;                                                    // 0x02A0(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GTASKActor
	 * Size -> 0x00B8 (FullSize[0x0358] - InheritedSize[0x02A0])
	 */
	class AGTASKActor : public AGTAActor
	{
	public:
		class UGTAPoseableComponent* Mesh;                                                    // 0x02A0(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bHasBoneTransformTweaks;                                 // 0x02A8(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_5U8W[0x7];                                   // 0x02A9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class USkeletalMesh*, struct FSkeletonToSkeletonMap>  maps;                                                    // 0x02B0(0x0050) Transient, Protected, NativeAccessSpecifierProtected
		bool                                                       bNeedsRawToFinalPose;                                    // 0x0300(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_WI9Z[0x17];                                  // 0x0301(0x0017) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSKBoneSituation                                    BikeSituation;                                           // 0x0318(0x0018) Edit, Protected, NativeAccessSpecifierProtected
		struct FSKBoneSituation                                    HunchedSituation;                                        // 0x0330(0x0018) Edit, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_FMK8[0x10];                                  // 0x0348(0x0010) MISSED OFFSET (PADDING)

	public:
		class USkeleton* GetOverrideSkeleton();
		struct FTransform GetBoneTransformTweak(const struct FTransform& InTransform, const class FName& InBoneName, bool* OutShouldRemove, const class FName& TweakType);
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GTAAOSkeletalProxy
	 * Size -> 0x0088 (FullSize[0x0328] - InheritedSize[0x02A0])
	 */
	class AGTAAOSkeletalProxy : public AGTAActor
	{
	public:
		class UStaticMeshComponent* ConstructedComponent;                                    // 0x02A0(0x0008) Edit, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent* AccompanyComponent;                                      // 0x02A8(0x0008) Edit, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UStaticMeshComponent*>                        WheelComponents;                                         // 0x02B0(0x0010) Edit, ExportObject, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic
		class UStaticMesh* GeneratedMesh;                                           // 0x02C0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USkeletalMesh* SrcMesh;                                                 // 0x02C8(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FString>                                      ExcludeBones;                                            // 0x02D0(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       bIncludeTranslucents;                                    // 0x02E0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAddWheels;                                              // 0x02E1(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_O4LR[0x2];                                   // 0x02E2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      WheelScaling;                                            // 0x02E4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FSkelProxyBoneTweak>                         BoneTweaks;                                              // 0x02E8(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FVector2D                                           MinMaxAO;                                                // 0x02F8(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMesh* AccompanyMesh;                                           // 0x0300(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FString>                                      OnlyTransferBones;                                       // 0x0308(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		class UMaterialInstanceConstant* WindowMIC;                                               // 0x0318(0x0008) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2ZJS[0x8];                                   // 0x0320(0x0008) MISSED OFFSET (PADDING)

	public:
		void ConstructStatic();
		void ApplyVertexColor();
		static UClass* StaticClass();
	};

	/**
	 * Class GTABase.GTASKProxyActor
	 * Size -> 0x0038 (FullSize[0x0390] - InheritedSize[0x0358])
	 */
	class AGTASKProxyActor : public AGTASKActor
	{
	public:
		int32_t                                                    CurSeed;                                                 // 0x0358(0x0004) Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        SkinColorMult;                                           // 0x035C(0x0010) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        ClothingColorMult;                                       // 0x036C(0x0010) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        AccessoryColorMult;                                      // 0x037C(0x0010) Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
