#pragma once

/**
 * Name: GTASA
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UI_HUD_Screen_SchoolTV.UI_HUD_Screen_SchoolTV_C.CustomBoolReturnFunction
	 */
	struct UUI_HUD_Screen_SchoolTV_C_CustomBoolReturnFunction_Params
	{
	public:
		class FString                                              FunctionName;                                            // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UI_HUD_Screen_SchoolTV.UI_HUD_Screen_SchoolTV_C.UpdateBlackFade
	 */
	struct UUI_HUD_Screen_SchoolTV_C_UpdateBlackFade_Params
	{
	public:
		float                                                      dT;                                                      // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_HUD_Screen_SchoolTV.UI_HUD_Screen_SchoolTV_C.GetMainIcon
	 */
	struct UUI_HUD_Screen_SchoolTV_C_GetMainIcon_Params
	{
	public:
		class UImage*                                              Image1;                                                  // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_HUD_Screen_SchoolTV.UI_HUD_Screen_SchoolTV_C.Tick
	 */
	struct UUI_HUD_Screen_SchoolTV_C_Tick_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		float                                                      InDeltaTime;                                             // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_HUD_Screen_SchoolTV.UI_HUD_Screen_SchoolTV_C.CustomFunctionWithFloat
	 */
	struct UUI_HUD_Screen_SchoolTV_C_CustomFunctionWithFloat_Params
	{
	public:
		class FString                                              FunctionName;                                            // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		float                                                      floatNum;                                                // 0x0010(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UI_HUD_Screen_SchoolTV.UI_HUD_Screen_SchoolTV_C.ExecuteUbergraph_UI_HUD_Screen_SchoolTV
	 */
	struct UUI_HUD_Screen_SchoolTV_C_ExecuteUbergraph_UI_HUD_Screen_SchoolTV_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
